[{
  "id": "smart-pill-dispenser",
  "title": "Smart Pill Dispenser",
  "year": "2024",
  "role": "Embedded Firmware Developer",
  "tags": ["Embedded Systems", "STM32", "Healthcare", "Sensors & Actuators", "Prototype"],

  "heroImage": "./images/SmartPill.jpeg",
  "heroAlt": "Smart pill dispenser prototype",

  "sections": [
    {
      "type": "text",
      "title": "Project Background",
      "content": "The Smart Pill Dispenser was developed as a school project focused on improving medication management in both hospital and home-care environments. It addresses common medication errors caused by forgetfulness, manual scheduling, and human oversight, especially among elderly users and busy healthcare staff. The system is built using an STM32 microcontroller and automates pill dispensing at scheduled times while confirming dispensing activity through sensors."
    },

    {
      "type": "text",
      "title": "Problem",
      "content": "Many patients, particularly elderly users, forget to take medication or accidentally take it more than once. In hospital settings, manual medication handling increases staff workload and raises the risk of missed or incorrect doses during busy routines."
    },
{
  "type": "text",
  "title": "Solution",
  "content": "The system automates medication dispensing by releasing pills at predefined times and verifying the dispensing process using sensors. This reduces reliance on memory and manual handling, improving medication safety and consistency. In normal mode, the dispenser runs its scheduled cycles automatically, while configuration mode (unlocked via RFID and keypad input) is used by authorised staff to adjust or update medication timings before returning to normal operation."
},
      {
  "type": "image",
  "src": "./images/SmartPill_Working.png",
  "alt": "Working principle of the smart pill dispenser",
  "caption": "Illustration showing the pill dispensing mechanism, sensor detection, and control flow."
},
    {
      "type": "list",
      "title": "My Role",
      "items": [
        "Programmed STM32 microcontroller using Embedded C++.",
        "Integrated RTC, RFID, IR sensor, and servo motor.",
        "Debugged electrical wiring and firmware issues.",
        "Tested system reliability and dispensing accuracy."
      ]
    },
    {
  "type": "image",
  "src": "./images/SmartPillBlockDiagram.jpeg",
  "alt": "System block diagram of the smart pill dispenser",
  "caption": "Block diagram showing the STM32 microcontroller, input sensors, user interfaces, and output devices."
},
{
  "type": "list",
  "title": "System Flow & Operation",
  "items": [
    "System starts in normal operating mode after power-up.",
    "Authorised staff can enter configuration mode using RFID authentication.",
    "In configuration mode, the keypad is used to set or update medication schedules.",
    "Configuration options and system status are shown on the OLED display.",
    "RTC continuously keeps track of the current time.",
    "When a scheduled dispensing time is reached, the STM32 triggers the dispensing process.",
    "Servo motor rotates to release a single pill.",
    "IR sensor confirms whether a pill has been successfully dispensed.",
    "PIR sensor detects user presence near the dispenser during operation.",
    "System status, alerts, and feedback are displayed on the OLED and LCD screens.",
    "After dispensing, the system returns to normal mode and waits for the next scheduled cycle."
  ]
},
    {
      "type": "text",
      "title": "Outcomes",
      "content": [
        "Our project was made possible by developing an automated pill dispensing system using STM32 firmware and Embedded C++, integrating RTC scheduling, servo control, and IR/PIR sensor feedback to ensure accurate and reliable dispensing. This design reduced missed or double doses during testing and improved overall system safety through RFID-based configuration access that prevented unauthorised changes. The system was validated through repeated end-to-end prototype testing, demonstrating stable operation across multiple dispensing cycles."
      ]
    },
    {
      "type": "list",
      "title": "Technical Summary",
      "items": [
        "Microcontroller: STM32F103RB",
        "Programming Language: Embedded C++",
        "Sensors: IR sensor, PIR sensor",
        "Actuator: Servo motor",
        "Modules: RFID RC522, RTC DS3231",
        "Displays: OLED (SSD1306), LCD",
        "Application Area: Healthcare automation"
      ]
    },
{
  "type": "gallery",
  "title": "Prototype & Internal Views",
  "items": [
    {
      "src": "./images/SmartPill2.jpeg",
      "alt": "Front view of the smart pill dispenser",
      "caption": "Front view showing keypad and display."
    },
    {
      "src": "./images/DispensingMechanism.jpeg",
      "alt": "Internal dispensing mechanism and servo",
      "caption": "Internal dispensing mechanism and servo system."
    },
    {
      "src": "./images/Wiring.jpeg",
      "alt": "STM32 board and wiring",
      "caption": "STM32 microcontroller and internal wiring."
    }
  ]
}
  ],
  "links": [
    {
      "label": "Source Code",
      "url": "https://github.com/yourname/smart-pill-dispenser"
    }
  ]
},
  {
    "id": "supermarket-self-checkout",
    "title": "Supermarket Self-Checkout System",
    "year": "2025",
    "role": "Product Operations, DevOps & System Support",
    "tags": ["IoT", "Raspberry Pi", "Docker", "Web System"],

    "heroImage": "./images/SuperMarket.jpg",
    "heroAlt": "Supermarket self-checkout kiosk",

    "sections": [
      {
        "type": "text",
        "title": "Overview",
        "content": "A self-checkout system combining an IoT kiosk with a web backend to reduce queue time and improve checkout efficiency in supermarkets."
      },
      {
        "type": "text",
        "title": "Problem",
        "content": "Traditional staffed checkout counters create long queues and require more manpower during peak hours."
      },
      {
        "type": "text",
        "title": "Solution",
        "content": "Built a kiosk that allows customers to scan items and manage their cart locally, then sync data to a web backend for payment and receipt handling."
      },
      {
        "type": "list",
        "title": "Key Features",
        "items": [
          "Item scanning and cart management on kiosk",
          "Cart data synced with web application",
          "Containerised backend for easy deployment",
          "Support for offline and online operation"
        ]
      },
      {
        "type": "list",
        "title": "My Role",
        "items": [
          "Maintained Dockerised backend and database",
          "Performed on-site troubleshooting for kiosk hardware",
          "Monitored system health and deployment stability",
          "Coordinated integration testing between kiosk and web system"
        ]
      },
      {
        "type": "list",
        "title": "Tools & Technologies",
        "items": [
          "Python",
          "Raspberry Pi",
          "Docker",
          "MariaDB / SQL",
          "REST APIs",
          "Web Frontend"
        ]
      },
      {
        "type": "youtube",
        "title": "System Demo",
        "id": "YYYYYYYYYYY"
      }
    ],

    "links": [
      {
        "label": "Source Code",
        "url": "https://github.com/LaWunShunLett/LaWunShunLett.github.io"
      }
    ]
  }
]
